[
    {
        "NPC ID": 410,
        "Description": "Provides tips and a general guide on how to acquire other NPCs. Provides recipes that include an item that is shown to him when the 'crafting' option is selected.",
        "Spawn Requirement": "Always already present when starting a new world.",
        "Selling List": []
    },
    {
        "NPC ID": 411,
        "Description": "Sells basic tools and supplies.",
        "Spawn Requirement": "All players combined have more than 50 in their inventories or when spawning in not the bees.",
        "Selling List": []
    },
    {
        "NPC ID": 412,
        "Description": "Heals players and cancels debuffs in exchange for coins.",
        "Spawn Requirement": "A player has more than 100 health.",
        "Selling List": []
    },
    {
        "NPC ID": 413,
        "Description": "Sells explosives.",
        "Spawn Requirement": "A player has an explosive in their inventory or when spawning in For The Worthy.",
        "Selling List": []
    },
    {
        "NPC ID": 414,
        "Description": "Sells the Dye Vat crafting station. Provides rare dyes in exchange for Strange Plants.",
        "Spawn Requirement": "A player has a dye item or any item used to craft dye in their inventory. In addition, a player must either defeat a pre-Hardmode boss or have a Strange Plant in their inventory.",
        "Selling List": []
    },
    {
        "NPC ID": 415,
        "Description": "Gives fishing quests and rewards players for completing them.",
        "Spawn Requirement": "Found and spoken to in an Ocean biome.",
        "Selling List": []
    },
    {
        "NPC ID": 416,
        "Description": "Sells vanity, mount, pet, and critter-themed items.",
        "Spawn Requirement": "At least 10% of the Bestiary (53 entries) has been filled.",
        "Selling List": []
    },
    {
        "NPC ID": 417,
        "Description": "Sells nature/Corruption/Crimson items, and can report the percentage of Corruption/Crimson and Hallow in the world.",
        "Spawn Requirement": "A boss has been defeated other than King Slime, Lepus, and the Wall of Flesh.",
        "Selling List": []
    },
    {
        "NPC ID": 418,
        "Description": "Sells paint, painting tools, and paintings.",
        "Spawn Requirement": "8 /  4 other town NPCs have been acquired (including the Old Man and Traveling Merchant).",
        "Selling List": []
    },
    {
        "NPC ID": 419,
        "Description": "Sells Golf Clubs, Balls, and other golfing items.",
        "Spawn Requirement": "Found and spoken to in the Underground Desert.",
        "Selling List": []
    },
    {
        "NPC ID": 420,
        "Description": "Sells guns, bullets, and other ammunition.",
        "Spawn Requirement": "A player has bullets or a gun that shoots bullets in their inventory.",
        "Selling List": []
    },
    {
        "NPC ID": 421,
        "Description": "Sells items that summon and help with fighting the Old One's Army. Most items cost Defender Medals, except for Eternia Crystals, the Eternia Crystal Stand, and Ale, which cost ordinary coins.",
        "Spawn Requirement": "Found and spoken to, after the Eater of Worlds or Brain of Cthulhu has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 422,
        "Description": "Can change the player's hairstyle and sells Hair Dyes.",
        "Spawn Requirement": "Found and spoken to in a Spider Cave.",
        "Selling List": []
    },
    {
        "NPC ID": 423,
        "Description": "Sells items such as the Tinkerer's Workshop, and can reforge items.",
        "Spawn Requirement": "Found and spoken to in the Cavern layer, after a Goblin Invasion has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 424,
        "Description": "Sells the Blowgun, the Imbuing Station, summoner equipment, Fountains, and Leaf Wings.",
        "Spawn Requirement": "The Queen Bee has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 425,
        "Description": "Sells some vanity items, including the Familiar set.",
        "Spawn Requirement": "Skeletron has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 426,
        "Description": "Sells the Wrench, Wire, and other mechanism-related items.",
        "Spawn Requirement": "Found and spoken to in the Dungeon.",
        "Selling List": []
    },
    {
        "NPC ID": 427,
        "Description": "Sells novelty items that create colorful visual effects.",
        "Spawn Requirement": "1/40 chance of spawning after  14 /  8 other town NPCs (including the Old Man and Traveling Merchant) have been acquired.",
        "Selling List": []
    },
    {
        "NPC ID": 428,
        "Description": "Sells magic-related items.",
        "Spawn Requirement": "Found and spoken to in the Cavern layer.",
        "Selling List": []
    },
    {
        "NPC ID": 429,
        "Description": "Collects property taxes from other NPCs. Earns 50 per NPC present, collectible by the player.",
        "Spawn Requirement": "A Tortured Soul is transformed with Purification Powder in the Underworld.",
        "Selling List": []
    },
    {
        "NPC ID": 430,
        "Description": "Sells the Autohammer, Mushroom Spear, and other mushroom-themed items.",
        "Spawn Requirement": "A house is available in an above-ground Glowing Mushroom biome during Hardmode.",
        "Selling List": []
    },
    {
        "NPC ID": 431,
        "Description": "Sells the Cannon and other pirate-themed items.",
        "Spawn Requirement": "A Pirate Invasion has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 432,
        "Description": "Sells the Clentaminator, Teleporter, Jetpack, and other items.",
        "Spawn Requirement": "A mechanical boss has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 433,
        "Description": "Sells the Proximity Mine Launcher, Rockets, and Nanites.",
        "Spawn Requirement": "Plantera has been defeated.",
        "Selling List": []
    },
    {
        "NPC ID": 434,
        "Description": "Sells the Santa set, colored lights, Christmas trees and their decorations.",
        "Spawn Requirement": "The Frost Legion has been defeated and it is Christmas.",
        "Selling List": []
    },
    {
        "NPC ID": 435,
        "Description": "Sells the Royal set, Royal Scepter, Glass Slipper, the Prince set, Potted Crystal Plants, three unique paintings and an addition to the Music Boxes collection.",
        "Spawn Requirement": "Every other NPC is housed (except Santa Claus and town pets).",
        "Selling List": []
    },
    {
        "NPC ID": 439,
        "Description": "Stays until the evening, sells a random selection of unique items each day.",
        "Spawn Requirement": "22.12% spawn chance during morning hours (04:30AM - 12:00PM) once two other NPCs are present.",
        "Selling List": []
    },
    {
        "NPC ID": 440,
        "Description": "Found at the entrance to the Dungeon. Summons Skeletron when spoken to, but only at night. Once Skeletron is defeated, the Old Man moves into town as the Clothier.",
        "Spawn Requirement": "Starting a new world.",
        "Selling List": []
    },
    {
        "NPC ID": 441,
        "Description": "Sells Counterweights, Spelunker Glowsticks, Magic Lantern, the Yoyo Glove and some other items, based on the lunar cycle. Some items such as the Slap Hand can only be obtained from him.",
        "Spawn Requirement": "Rarely found in the Caverns.",
        "Selling List": []
    }
]