[
    {
        "Item ID": "2450",
        "Rarity": "-11",
        "Height": "Underground, Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "Na na na na na na na Bat-FISH! That means go digging underground, fetch it, and bring it to me!"
    },
    {
        "Item ID": "2451",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Any (Must be fished from Honey)",
        "Angler Quote": "The subterranean jungles of <name of world> have the weirdest things! Like, there's this fish I saw that looked just like a giant bumblebee! I'm allergic to bees, so you have to catch it for me! I bet it'd taste like a tuna and honey sandwich!"
    },
    {
        "Item ID": "2452",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Jungle",
        "Angler Quote": "I finally found a jungle cat that likes water! I think it's because it's also part fish. I don't know why this happened, and I don't want to know. I just want it in my hands, and make it snappy!"
    },
    {
        "Item ID": "2453",
        "Rarity": "-11",
        "Height": "Sky",
        "Biome": "Forest",
        "Angler Quote": "There's a rumor going around that there are islands that float high up in the sky, and that they have amazing treasure! Who cares about that though, what's even cooler is that sometimes lakes form in the clouds, and in those lakes are fish made out of clouds! I wanna know what it tastes like, so you better go catch it for me!"
    },
    {
        "Item ID": "2454",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Corruption (Hardmode)",
        "Angler Quote": "There's a cursed fish swimming in the waters of the deepest corruption! It was forged of the cursed flames that spread from the fallen horrors that lurk down there. They say not even water can put out this fire, and that it can burn forever. I can think of some awesome things I can do with a fish like that! You gonna go get it for me, or are you too chicken!?"
    },
    {
        "Item ID": "2455",
        "Rarity": "-11",
        "Height": "Surface, Underground",
        "Biome": "Forest",
        "Angler Quote": "I was reeling in the big one when this funny talking zombie burst out of the forest lake and started rambling on about this 'ferocious' species of fish made out of dirt! He says it could suffocate ten blokes his size, or something like that... I want it! NOW!"
    },
    {
        "Item ID": "2456",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Forest",
        "Angler Quote": "The demolitionist was raising cane about losing a stick of dynamite in the lake out in the forest. He has like, so many, so why does one matter? Apparently, because it grew fins and started swimming away! I don't know where he gets his materials to make those things, but that one is clearly possessed! Reel it in and bring it to me, I always wanted a suicide bombing fish! Don't ask why..."
    },
    {
        "Item ID": "2457",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Corruption",
        "Angler Quote": "I bet you're not brave enough to find the Eater of Plankton. A corrupt fish that was mutated from a severed piece of the Eater of Worlds itself! Capture it and bring it to me, and prove to me you're not a wuss!"
    },
    {
        "Item ID": "2458",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Forest/Any",
        "Angler Quote": "I love collecting those bright yellow stars that fall from the sky! I love it even more when they land on someone's head. But.. but.. nothing beats a star that falls in a foresty lake and turns into a fish! That's just totally rad, and you're just rad enough to get it for me!"
    },
    {
        "Item ID": "2459",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Forest",
        "Angler Quote": "Apparently, Demon Eyes can sometimes be amphibious. They don't fly, they swim! I want to see the look on someone's face when they find it in their bathtub! They hang around the same areas. That means you reel one in for me!"
    },
    {
        "Item ID": "2460",
        "Rarity": "-11",
        "Height": "Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "I don't know what's worse, a bone fish or a bone fish with HANDS. This Fish-o-Tron deep in the caverns really freaks me out! I think it's possessed by the same evil spirits that possessed that old man by the dungeon! I double duck dare you to go catch it!"
    },
    {
        "Item ID": "2461",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Forest",
        "Angler Quote": "I was trying to sleep by the hill lakeside when this fish swooped down at me. It was flying! It also had the face of a lady and had feathers! I think I screamed louder than she did! Hey you, go make her pay for scaring me like that!"
    },
    {
        "Item ID": "2462",
        "Rarity": "-11",
        "Height": "Cavern, Underworld",
        "Biome": "Forest (Hardmode)",
        "Angler Quote": "There's a piece of the Hunger that morphed from the Wall of Flesh into a small fish-like thing that swims around aimlessly in the underworld and it's gross and it's yucky and I want it now!"
    },
    {
        "Item ID": "2463",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Crimson (Hardmode)",
        "Angler Quote": "Did you know deep in the crimson, some of those creatures make this gross yellow stuff? I overheard a crazy story about a pool of it having melted together into a shape of a fish and it swims around and everything! Fetch it for me, so I can stick it in someone's toilet!"
    },
    {
        "Item ID": "2464",
        "Rarity": "-11",
        "Height": "Underground, Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "Oooooohhh, I'm going to be SO rich! Deep in the caverns, there is a fish made out of gemstones! Don't ask me how, I don't know, all I know is that this fish is totally awesome and you're going to catch it for me!"
    },
    {
        "Item ID": "2465",
        "Rarity": "-11",
        "Height": "Underground, Cavern",
        "Biome": "Hallow (Hardmode)",
        "Angler Quote": "There's some interesting critters to be found in the deeper Hallows, I tell you! They glow this crazy purple color and it messes with my eyes! It's totally wild, so I want you to catch a fish like that for me!"
    },
    {
        "Item ID": "2466",
        "Rarity": "-11",
        "Height": "Underground, Cavern, Underworld",
        "Biome": "Snow Biome",
        "Angler Quote": "What's white and tan and fluffy and lives in a frozen underground lake? A mutant flinxfin! I wasn't telling a joke, you know, there really is a mutated variety of Flinx that is more adapted to an aquatic lifestyle! I want it to adapt to my fishbowl, so make sure that happens!"
    },
    {
        "Item ID": "2467",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Snow Biome",
        "Angler Quote": "It's a whale! It's a dolphin! No, it's a penguin fish! Oh, and look, it's you! You get to bring me one! You do know they only like cold water, right?"
    },
    {
        "Item ID": "2468",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Hallow",
        "Angler Quote": "There's a really really rare type of pixie that's born with so many wings that it can't actually fly! It swims with the fishes in the lakes surrounded by that blue colored grass. My fish tank needs a lamp, so I want you to catch me that pixie!"
    },
    {
        "Item ID": "2469",
        "Rarity": "-11",
        "Height": "Underground, Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "I saw a fish that had eight legs! Nope! Not happening! You're fishing it for me, so it's not alive when I hold it! That's the last time I go fishing so deep in the cavern!"
    },
    {
        "Item ID": "2470",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Snow Biome",
        "Angler Quote": "You ever wonder why the lakes on the surface of the snowy areas of <name of world> never ice over? I don't. The fish, however, do! A fish made out of ice would make a great offering to the mighty and amazing <name of Angler>! Go, my loyal subject, and bring me this Tundra Trout with haste!"
    },
    {
        "Item ID": "2471",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Hallow",
        "Angler Quote": "Unicorns and rainbows are absolutely great! They're everywhere, even in the water. No, really, I actually saw a unicorn fish in the Hallowed lake! Your job is to reel it up and let me have it as a pet!"
    },
    {
        "Item ID": "2472",
        "Rarity": "-11",
        "Height": "Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "Those demons in the underworld really like voodoo dolls, but I think there's a doll out there who was blasted with way too much magic! It turned into a fish and it does stuff on its own. I dare you to go down and get me one! I'd watch out for the boiling lava, because it burns you to death and that won't get me my fish!"
    },
    {
        "Item ID": "2473",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Any (Hardmode)",
        "Angler Quote": "I know something youuuuu don't! Fine, I'll tell you, there's a terrifying creature that flies among the stars! I'm not making this up! It's called a Wyvern! But, but, you knew that already, right? Well what you don't know is that they are born and raised as tadpoles! So, they're actually like.. well, a frog! Hop to it and get me one!"
    },
    {
        "Item ID": "2474",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Forest",
        "Angler Quote": "You won't believe it! I caught a fish in the forest at night that was already dead! Then it tried to eat me! I threw it away and ran! Now I want to stick it in someone's dresser to see what happens, so go fish it back up for me will ya?!"
    },
    {
        "Item ID": "2475",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Glowing Mushroom biome",
        "Angler Quote": "I found this spectacular place draped in giant glowing mushrooms! Everything was blue! I was picking some of the mushrooms I found next to a glistening blue lake, when one of the mushrooms snapped at me and swam away! I want to give it a taste of its own medicine, and give it a good chompin'! What I mean is, you gotta get it for me!"
    },
    {
        "Item ID": "2476",
        "Rarity": "-11",
        "Height": "Sky",
        "Biome": "Forest",
        "Angler Quote": "Did you know there's magical islands that float up high in the sky? Bet you didn't! They say angels live in the sky, and I believe those angels have fins and gills and swim around! I believe you must catch one for me!"
    },
    {
        "Item ID": "2477",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Crimson",
        "Angler Quote": "Ow! Don't get near me! I got stung by a Bloody Man-O-War! In case you're not smart enough to know what that is, it's the most menacing jellyfish in all of <name of world>! Go to that rotten crimson and catch it if you dare! "
    },
    {
        "Item ID": "2478",
        "Rarity": "-11",
        "Height": "Underground, Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "Normally I could care less if I see fishbones floating in the water underground, but this one was swimming! What, you thought that only human skeletons still flailed about in <name of world>? Get it for me so I can stick it in someone's bed!"
    },
    {
        "Item ID": "2479",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Forest",
        "Angler Quote": "Out in the forest, I was fishing right? Well guess what! A bunny hopped up to me! Then another one hopped up, and another... suddenly I'm surrounded by bunnies! One even swam up to me from the water, but it had no legs! I fell outta my chair in surprise and all the bunnies scurried off! I want that bunny fish as a pet, so you better catch it for me! Pronto!"
    },
    {
        "Item ID": "2480",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Ocean (Hardmode)",
        "Angler Quote": "Yarr matey! Shiver me timbers! Avast, scallywags! There's a pirate captain who once had a pet fish named Cap'n Tunabeard, but during a big storm the fishbowl fell overboard! It has a hook for a tail, and an eyepatch and everything! You need to fetch me that fish, so I can be as cool as a pirate! Obviously it's out in the ocean somewhere! Duh!"
    },
    {
        "Item ID": "2481",
        "Rarity": "-11",
        "Height": "Sky, Surface",
        "Biome": "Ocean",
        "Angler Quote": "I saw this bright orange and colorful fish by the ocean, and it was looking around frantically as though it was seeking a lost family member! Go catch it for me, so that another one will show up looking frantically for him instead!"
    },
    {
        "Item ID": "2482",
        "Rarity": "-11",
        "Height": "Cavern, Underworld",
        "Biome": "Forest",
        "Angler Quote": "I hear in the underworld, that the King of all demons is actually a fish! Just imagine the absolute power I would have if you caught it for me!"
    },
    {
        "Item ID": "2483",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Jungle (Hardmode)",
        "Angler Quote": "Those Derplings in the jungle are the most scary creatures I've ever seen! Good thing is, sometimes they don't have legs! These ones live in the water and are a lot less scary! Catch me one now so I can see what they taste like without being scared half to death!"
    },
    {
        "Item ID": "2484",
        "Rarity": "-11",
        "Height": "Underground, Cavern",
        "Biome": "Snow Biome (Hardmode)",
        "Angler Quote": "There's a legend of a mighty being known as the Fishron! It's part pig, part dragon, and part FISH! I hear it hangs around in the frozen subterranean lakes of the coldest part of the world! I'm not going there, so YOU go catch it and makes sure it lands in my hands! I'm so excited!"
    },
    {
        "Item ID": "2485",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Corruption",
        "Angler Quote": "A really long fish that looks like a sword's sheath swims in the murky waters of the corruption! It looks a lot like ebonstone, so don't let it fool you! That's right, you. You're catching it, not me!"
    },
    {
        "Item ID": "2486",
        "Rarity": "-11",
        "Height": "Any",
        "Biome": "Jungle",
        "Angler Quote": "Watch your step when wading through jungle waters! Why? No, not because I care about you being eaten by piranhas. I care because you'll step on one of my favorite kinds of fish, the Mud Fish! I also care a lot that you're going to grab me one as a pet!"
    },
    {
        "Item ID": "2487",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Forest",
        "Angler Quote": "In the forest, the slimes are kinda gross. Slimefish are even more so! I don't want to swim with slimes, so yoink one out of the water for me!"
    },
    {
        "Item ID": "2488",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Jungle",
        "Angler Quote": "Piranhas and sharks are ugly! Soooo ugly! Did you know there's a fish that looks very pretty and still can eat your face off? I would pay 2 platinum to see that happen, by the way... To the point, though, you catchy for me. Just make sure I have it before you lose your face!"
    },
    {
        "Item ID": "4393",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Desert",
        "Angler Quote": "I read this ancient story about a fish that looks like a magical scarab! That's beetle, for simpletons like you! Where do you find it? Where do you think? In the desert, duh! Don't look at me like that... it's true! There is actually water out there! I'd go, but I don't like having my eyeballs pecked out by vultures. So... you do it!"
    },
    {
        "Item ID": "4394",
        "Rarity": "-11",
        "Height": "Surface",
        "Biome": "Desert",
        "Angler Quote": "I'm sure someone, a really stupid someone, tried to tell you there was no water in the desert! They were absolutely and positively wrong! There's this thing called an Oasis, and it has water in it! Guess what happens when you have water!? That's right, you have fish! Weird fish that try to sting you and pinch you and do all kinds of other mean things to you! A perfect pet for me, and a perfect job for you!"
    }
]